app/Http/Controllers/Auth/SocialController.php

select * from `users` where `email` = 'starmoshiur@gmail.com' and `users`.`deleted_at` is null limit 1
---
    public function getSocialHandle($provider)
    {
        if (Input::get('denied') != '') {
            return redirect()->to('login')
            ->with('status', 'danger')
            ->with('message', trans('socials.denied'));
        }

        $socialUserObject = Socialite::driver($provider)->stateless()->user();

        $socialUser = null;

        // Check if email is already registered
        $userCheck = User::where('email', '=', $socialUserObject->email)->first();

insert into `profiles` (`user_id`, `updated_at`, `created_at`) values (1, '2019-03-04 14:27:52', '2019-03-04 14:27:52')
---
                $user->activated = true;

                $user->profile()->save($profile);
                $user->save();

select * from `users` where `name` = 'vorusrm' and `users`.`deleted_at` is null limit 1
---
    public function checkUserName($username, $email)
    {
        $userNameCheck = User::where('name', '=', $username)->first();