app/Http/Controllers/ProfilesController.php

    public function getUserByUsername($username)
    {
        return User::with('profile')->wherename($username)->firstOrFail();
---
select * from `profiles` where `profiles`.`user_id` in (1)
select * from `users` where `name` = 'vorusrm' and `users`.`deleted_at` is null limit 1

    public function deleteUserAccount(DeleteUserAccount $request, $id)
    {
        $currentUser = \Auth::user();
        $user = User::findOrFail($id);
        $ipAddress = new CaptureIpTrait();

        if ($user->id != $currentUser->id) {
            return redirect('profile/'.$user->name.'/edit')->with('error', trans('profile.errorDeleteNotYour'));
        }

        // Soft Delete User
        $user->delete();
---
update `users` set `deleted_at` = '2019-03-04 13:22:02', `updated_at` = '2019-03-04 13:22:02' where `id` = 1